docs/generated/telnet-core-machine.dot
digraph TelnetCoreMachine {
    rankdir=LR;
    node [shape=box];
    subgraph cluster_Connected {
        label="Connected";
        subgraph cluster_Accepting {
            label="Accepting";
            AfterCarriageReturn;
            DoNothing;
            GoAhead;
            Idle;
            ReadingCharacters;
        }
        Do;
        Dont;
        Refusing;
        StartNegotiation;
        subgraph cluster_SubNegotiation {
            label="SubNegotiation";
            Authentication;
            AuthenticationEnding;
            AuthenticationValue;
            Charset;
            CharsetEnding;
            CharsetTTable;
            CharsetValue;
            Encryption;
            EncryptionEnd;
            EncryptionEnding;
            EncryptionStart;
            EncryptionStartEnding;
            EncryptionValue;
            EndSubNegotiation;
            Environ;
            EnvironField;
            FlowControl;
            Gmcp;
            LineMode;
            LineModeValue;
            Mccp1;
            Mccp1AfterWill;
            Mccp2;
            Mccp3;
            Msdp;
            Mssp;
            Mxp;
            Naws;
            NewEnviron;
            NewEnvironField;
            ReadingOption;
            SubNegotiating;
            TerminalType;
            TerminalTypeSend;
            TerminalTypeValue;
            Tspeed;
            TspeedSend;
            TspeedValue;
            XDisplayLocation;
            XDisplayLocationSend;
            XDisplayLocationValue;
        }
        Willing;
    }
    Accepting -> ReadingCharacters [label="any"];
    ReadingCharacters -> ReadingCharacters [label="any run"];
    AfterCarriageReturn -> Idle [label="10"];
    AfterCarriageReturn -> Idle [label="0"];
    AfterCarriageReturn -> AfterCarriageReturn [label="13"];
    AfterCarriageReturn -> StartNegotiation [label="255"];
    AfterCarriageReturn -> ReadingCharacters [label="any"];
    Accepting -> Idle [label="10"];
    ReadingCharacters -> Idle [label="10"];
    StartNegotiation -> ReadingCharacters [label="255"];
    StartNegotiation -> GoAhead [label="249"];
    StartNegotiation -> Idle [label="239"];
    Willing -> Idle [label="any"];
    Refusing -> Idle [label="any"];
    Do -> Idle [label="any"];
    Dont -> Idle [label="any"];
    EndSubNegotiation -> Idle [label="240"];
    Connected -> Connected [label="InitializeConnection"];
    Accepting -> AfterCarriageReturn [label="13"];
    ReadingCharacters -> AfterCarriageReturn [label="13"];
    Accepting -> StartNegotiation [label="255"];
    ReadingCharacters -> StartNegotiation [label="255"];
    StartNegotiation -> Willing [label="251"];
    StartNegotiation -> Refusing [label="252"];
    StartNegotiation -> Do [label="253"];
    StartNegotiation -> Dont [label="254"];
    StartNegotiation -> SubNegotiation [label="250"];
    StartNegotiation -> DoNothing [label="241"];
    StartNegotiation -> Idle [label="any"];
    Willing -> StartNegotiation [label="255"];
    Refusing -> StartNegotiation [label="255"];
    Do -> StartNegotiation [label="255"];
    Dont -> StartNegotiation [label="255"];
    ReadingOption -> SubNegotiating [label="any"];
    SubNegotiating -> EndSubNegotiation [label="255"];
    EndSubNegotiation -> SubNegotiating [label="255"];
    EndSubNegotiation -> SubNegotiating [label="any"];
    SubNegotiating -> SubNegotiating [label="any run"];
    Naws -> Idle [label="240"];
    ReadingOption -> Naws [label="31"];
    Naws -> Naws [label="any run"];
    Naws -> Naws [label="255"];
    Naws -> Naws [label="240"];
    FlowControl -> Idle [label="240"];
    ReadingOption -> FlowControl [label="33"];
    FlowControl -> FlowControl [label="any"];
    FlowControl -> FlowControl [label="255"];
    TspeedSend -> Idle [label="240"];
    TspeedValue -> Idle [label="240"];
    ReadingOption -> Tspeed [label="32"];
    Tspeed -> TspeedSend [label="1"];
    Tspeed -> SubNegotiating [label="any"];
    TspeedSend -> TspeedSend [label="255"];
    TspeedSend -> TspeedSend [label="any"];
    Tspeed -> TspeedValue [label="0"];
    TspeedValue -> TspeedValue [label="any run"];
    TspeedValue -> TspeedValue [label="255"];
    XDisplayLocationSend -> Idle [label="240"];
    XDisplayLocationValue -> Idle [label="240"];
    ReadingOption -> XDisplayLocation [label="35"];
    XDisplayLocation -> XDisplayLocationSend [label="1"];
    XDisplayLocation -> SubNegotiating [label="any"];
    XDisplayLocationSend -> XDisplayLocationSend [label="255"];
    XDisplayLocationSend -> XDisplayLocationSend [label="any"];
    XDisplayLocation -> XDisplayLocationValue [label="0"];
    XDisplayLocationValue -> XDisplayLocationValue [label="any run"];
    XDisplayLocationValue -> XDisplayLocationValue [label="255"];
    ReadingOption -> Gmcp [label="201"];
    Gmcp -> Gmcp [label="any run"];
    Gmcp -> Gmcp [label="255"];
    Gmcp -> Idle [label="240"];
    ReadingOption -> Msdp [label="69"];
    Msdp -> Msdp [label="any run"];
    Msdp -> Msdp [label="255"];
    Msdp -> Idle [label="240"];
    ReadingOption -> Mssp [label="70"];
    Mssp -> Mssp [label="1"];
    Mssp -> Mssp [label="2"];
    Mssp -> Mssp [label="any run"];
    Mssp -> Mssp [label="255"];
    Mssp -> Idle [label="240"];
    TerminalTypeSend -> Idle [label="240"];
    TerminalTypeValue -> Idle [label="240"];
    ReadingOption -> TerminalType [label="24"];
    TerminalType -> TerminalTypeSend [label="1"];
    TerminalType -> SubNegotiating [label="any"];
    TerminalTypeSend -> TerminalTypeSend [label="255"];
    TerminalTypeSend -> TerminalTypeSend [label="any"];
    TerminalType -> TerminalTypeValue [label="0"];
    TerminalTypeValue -> TerminalTypeValue [label="any run"];
    TerminalTypeValue -> TerminalTypeValue [label="255"];
    CharsetValue -> Idle [label="240"];
    Charset -> CharsetTTable [label="4"];
    CharsetTTable -> CharsetTTable [label="any run"];
    CharsetTTable -> CharsetTTable [label="255"];
    CharsetTTable -> Idle [label="240"];
    CharsetEnding -> Idle [label="240"];
    ReadingOption -> Charset [label="42"];
    Charset -> SubNegotiating [label="any"];
    Charset -> CharsetValue [label="1"];
    Charset -> CharsetValue [label="2"];
    CharsetValue -> CharsetValue [label="any run"];
    CharsetValue -> CharsetValue [label="255"];
    Charset -> CharsetEnding [label="3"];
    Charset -> CharsetEnding [label="5"];
    Charset -> CharsetEnding [label="6"];
    Charset -> CharsetEnding [label="7"];
    CharsetEnding -> CharsetEnding [label="255"];
    CharsetEnding -> CharsetEnding [label="any"];
    NewEnviron -> NewEnvironField [label="0"];
    NewEnviron -> NewEnvironField [label="1"];
    NewEnviron -> NewEnvironField [label="2"];
    NewEnvironField -> NewEnvironField [label="0"];
    NewEnvironField -> NewEnvironField [label="3"];
    NewEnvironField -> NewEnvironField [label="1"];
    NewEnvironField -> NewEnvironField [label="any run"];
    NewEnvironField -> NewEnvironField [label="2"];
    NewEnvironField -> NewEnvironField [label="255"];
    NewEnvironField -> Idle [label="240"];
    ReadingOption -> NewEnviron [label="39"];
    NewEnviron -> SubNegotiating [label="any"];
    Environ -> EnvironField [label="0"];
    Environ -> EnvironField [label="1"];
    EnvironField -> EnvironField [label="0"];
    EnvironField -> EnvironField [label="1"];
    EnvironField -> EnvironField [label="any run"];
    EnvironField -> EnvironField [label="2"];
    EnvironField -> EnvironField [label="255"];
    EnvironField -> Idle [label="240"];
    ReadingOption -> Environ [label="36"];
    Environ -> SubNegotiating [label="any"];
    Mxp -> Idle [label="240"];
    ReadingOption -> Mxp [label="91"];
    Mxp -> Mxp [label="255"];
    Mxp -> Mxp [label="any"];
    Mccp2 -> Idle [label="240"];
    Mccp3 -> Idle [label="240"];
    Mccp1AfterWill -> Idle [label="240"];
    ReadingOption -> Mccp2 [label="86"];
    Mccp2 -> Mccp2 [label="255"];
    Mccp2 -> Mccp2 [label="any"];
    ReadingOption -> Mccp3 [label="87"];
    Mccp3 -> Mccp3 [label="255"];
    Mccp3 -> Mccp3 [label="any"];
    ReadingOption -> Mccp1 [label="85"];
    Mccp1 -> Mccp1AfterWill [label="251"];
    Mccp1 -> SubNegotiating [label="any"];
    Mccp1AfterWill -> Mccp1 [label="any"];
    LineModeValue -> Idle [label="240"];
    ReadingOption -> LineMode [label="34"];
    LineMode -> SubNegotiating [label="any"];
    LineMode -> LineModeValue [label="1"];
    LineMode -> LineModeValue [label="2"];
    LineMode -> LineModeValue [label="3"];
    LineModeValue -> LineModeValue [label="any run"];
    LineModeValue -> LineModeValue [label="255"];
    AuthenticationEnding -> Idle [label="240"];
    ReadingOption -> Authentication [label="37"];
    Authentication -> SubNegotiating [label="any"];
    Authentication -> AuthenticationValue [label="1"];
    Authentication -> AuthenticationValue [label="0"];
    AuthenticationValue -> AuthenticationValue [label="any run"];
    AuthenticationValue -> AuthenticationEnding [label="255"];
    AuthenticationEnding -> AuthenticationEnding [label="any"];
    AuthenticationEnding -> AuthenticationValue [label="255"];
    EncryptionEnding -> Idle [label="240"];
    EncryptionStartEnding -> Idle [label="240"];
    EncryptionEnd -> Idle [label="240"];
    ReadingOption -> Encryption [label="38"];
    Encryption -> SubNegotiating [label="any"];
    Encryption -> EncryptionValue [label="1"];
    Encryption -> EncryptionValue [label="0"];
    EncryptionValue -> EncryptionValue [label="any run"];
    EncryptionValue -> EncryptionEnding [label="255"];
    EncryptionEnding -> EncryptionEnding [label="any"];
    EncryptionEnding -> EncryptionValue [label="255"];
    Encryption -> EncryptionStart [label="3"];
    EncryptionStart -> EncryptionStart [label="any run"];
    EncryptionStart -> EncryptionStartEnding [label="255"];
    EncryptionStartEnding -> SubNegotiating [label="any"];
    EncryptionStartEnding -> EncryptionStart [label="255"];
    Encryption -> EncryptionEnd [label="4"];
    EncryptionEnd -> EncryptionEnd [label="255"];
    EncryptionEnd -> EncryptionEnd [label="any"];
}
